app/views/outs/index.html.erb

      <td><%= outcoming.date.to_formatted_s(:long_ordinal) %></td>
      <td><%= Item.find(outcoming.item_id).name %></td>
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT 1  [["id", 9]]