app/views/outs/new.html.erb

SELECT "items".* FROM "items"  ORDER BY name DESC
---
    <td><%= f.date_select :date %></td>
    <td><%= f.select :item_id, Item.all.order('name ASC').map { |i| [i.name, i.id]}, :hide_label => true%></td>