app/views/items/index.html.erb

		amount_bought = In.where(:item_id => item.id).where.not(:from => "own").sum(:amount)
		amount = amount_in - Out.where(:item_id => item.id).sum(:amount)
---
SELECT SUM("outs"."amount") FROM "outs" WHERE "outs"."item_id" = ?  [["item_id", 9]]

	  <td><div align=right>
	    <%= amount_sold = Out.where(:item_id => item.id, :paid => true).sum(:price)
---
SELECT "outs".* FROM "outs" WHERE "outs"."item_id" = ? AND "outs"."paid" = ?  [["item_id", 10], ["paid", "t"]]
SELECT SUM("outs"."amount") FROM "outs" WHERE "outs"."item_id" = ? AND "outs"."paid" = ?  [["item_id", 14], ["paid", "t"]]