app/views/ins/index.html.erb

      <td><%= incoming.date.to_formatted_s(:long_ordinal) %></td>
      <td><%= Item.find(incoming.item_id).name %></td>
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT 1  [["id", 7]]