app/views/ins/new.html.erb

    <td><%= f.date_select :date %></td>
    <td><%= f.select :item_id, Item.all.order('name ASC').map { |i| [i.name, i.id]}, :hide_label => true%></td>
---
SELECT "items".* FROM "items"  ORDER BY name ASC