app/controllers/items_controller.rb

SELECT "items".* FROM "items"
---
  def index
    @items = Item.all.sort_by(&:name)

INSERT INTO "items" ("name", "scientific_name", "amount", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Sibirian Housepaprika"], ["scientific_name", "Capsicum"], ["amount", 30], ["created_at", "2016-08-08 20:52:14.421895"], ["updated_at", "2016-08-08 20:52:14.421895"]]
---
def create
    @item = Item.new(item_params)

    if @item.save

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "items" SET "scientific_name" = ?, "amount" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["scientific_name", "Douglah x Naga"], ["amount", 0], ["updated_at", "2016-08-10 16:18:15.457691"], ["id", 9]]
---
  def update
    @item = Item.find(params[:id])

    if @item.update(item_params)