app/controllers/outs_controller.rb

  def index
    @outs = Out.all.order('date DESC')
---
SELECT "outs".* FROM "outs"  ORDER BY date DESC

  def show
    @out = Out.find(params[:id])
---
SELECT  "outs".* FROM "outs" WHERE "outs"."id" = ? LIMIT 1  [["id", 2]]

  def edit
    @out = Out.find(params[:id])
---
SELECT  "outs".* FROM "outs" WHERE "outs"."id" = ? LIMIT 1  [["id", 5]]

  def create
    @out = Out.new(out_params)
    if @out.save
---
INSERT INTO "outs" ("item_id", "amount", "price", "to", "paid", "date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)  [["item_id", 9], ["amount", 123.0], ["price", 312.0], ["to", ""], ["paid", "t"], ["date", "2016-08-10"], ["created_at", "2016-08-10 15:33:30.160945"], ["updated_at", "2016-08-10 15:33:30.160945"]]

  def destroy
    @out = Out.find(params[:id])
    @out.destroy
---
SELECT  "outs".* FROM "outs" WHERE "outs"."id" = ? LIMIT 1  [["id", 2]]
DELETE FROM "outs" WHERE "outs"."id" = ?  [["id", 2]]

  def update
    @out = Out.find(params[:id])

    if @out.update(out_params)
---
SELECT  "outs".* FROM "outs" WHERE "outs"."id" = ? LIMIT 1  [["id", 24]]
UPDATE "outs" SET "to" = ?, "paid" = ?, "updated_at" = ? WHERE "outs"."id" = ?  [["to", ""], ["paid", "t"], ["updated_at", "2016-08-10 16:50:04.424148"], ["id", 24]]